In [1]:
import pandas as pd

# PANDA DATA

### Create Data

In [2]:
data = {
    'Name':['Pandy','Sandy','Randy','Mandy','Candy','Landy'],
    'Age':[6,7,4,5,4,2],
    'Bamboo Stick': [10,15,20,25,30,35]
}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### shape

In [5]:
df.shape

(6, 3)

### info

In [6]:
df.info

<bound method DataFrame.info of     Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35>

### Head (first five rows)

In [7]:
df.head()

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30

In [8]:
df.head(2)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15

### Tail (last five rows)

In [9]:
df.tail()

    Name  Age  Bamboo Stick
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [10]:
df.tail(3)

    Name  Age  Bamboo Stick
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

### Filtering

In [11]:
df[df['Age']<5]

    Name  Age  Bamboo Stick
2  Randy    4            20
4  Candy    4            30
5  Landy    2            35

df[df['Age']<5] 
df, data frame name used for filtering
[df['Age']<5] is the logic

#### Multiple filtering

In [12]:
df[['Bamboo Stick','Age']]

   Bamboo Stick  Age
0            10    6
1            15    7
2            20    4
3            25    5
4            30    4
5            35    2

In [13]:
df[ (df['Age']>4) & (df['Bamboo Stick']>10) ]

    Name  Age  Bamboo Stick
1  Sandy    7            15
3  Mandy    5            25

### Add Column

In [14]:
df['Place']=['Greenland', 'Siberia', 'Antartica','Greenland', 'Siberia', 'Antartica']

In [15]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### Drop Duplicate

In [16]:
df.drop_duplicates(subset=['Place'])

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

In [17]:
df.drop_duplicates(subset=['Place'],keep='first' )

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

In [18]:
df.drop_duplicates(subset=['Place'],keep='last' )

    Name  Age  Bamboo Stick      Place
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### Vlaue Counts

In [19]:
df['Place'].value_counts()

Place
Greenland    2
Siberia      2
Antartica    2
Name: count, dtype: int64

In [20]:
df['Age'].value_counts()

Age
4    2
6    1
7    1
5    1
2    1
Name: count, dtype: int64

### Transpose

In [21]:
df.T

                      0        1          2          3        4          5
Name              Pandy    Sandy      Randy      Mandy    Candy      Landy
Age                   6        7          4          5        4          2
Bamboo Stick         10       15         20         25       30         35
Place         Greenland  Siberia  Antartica  Greenland  Siberia  Antartica

### Update (loc)

In [22]:
df.loc[df['Name']== 'Pandy', 'Age']=6

In [23]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

df.loc is the function name, df is the name of the dataframe
[df['Name']== 'Pandy', 'Age'] tracks row location
['Name']== 'Pandy' Row information
=6 is the updated value

#### Delete one Column

In [24]:
df.drop('Place',axis=1)

    Name  Age  Bamboo Stick
0  Pandy    6            10
1  Sandy    7            15
2  Randy    4            20
3  Mandy    5            25
4  Candy    4            30
5  Landy    2            35

In [25]:
#### Delete multiple Column

In [26]:
#df.drop(['Place','Bamboo Stick'],axis=1)

#### Delete Row

In [27]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

In [28]:
 df.drop(df[df['Name'] == 'Candy'].index)

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
5  Landy    2            35  Antartica

‚úÖ df[df['Name'] == 'Sandy'].index gives you the actual row index/indices where Name == 'Sandy'.
üîç .index in pandas is used to access the row labels (i.e., the indices) of a DataFrame or Series.

In [29]:
df

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica
3  Mandy    5            25  Greenland
4  Candy    4            30    Siberia
5  Landy    2            35  Antartica

### iloc

### show row data

In [30]:
df.iloc[2]

Name                Randy
Age                     4
Bamboo Stick           20
Place           Antartica
Name: 2, dtype: object

In [31]:
df.iloc[:3]

    Name  Age  Bamboo Stick      Place
0  Pandy    6            10  Greenland
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

In [32]:
df.iloc[1:3]

    Name  Age  Bamboo Stick      Place
1  Sandy    7            15    Siberia
2  Randy    4            20  Antartica

### show coulmn data

In [33]:
df ['Place']

0    Greenland
1      Siberia
2    Antartica
3    Greenland
4      Siberia
5    Antartica
Name: Place, dtype: object

#### row and column

In [34]:
df.iloc [0:2,1:3]

   Age  Bamboo Stick
0    6            10
1    7            15

###  New index

In [35]:
import pandas as pd

df = pd.DataFrame(
    {
        'Name': ['Pandy', 'Sandy', 'Randy', 'Mandy', 'Candy', 'Landy'],
        'Age': [6, 7, 4, 5, 4, 2],
        'Bamboo Stick': [10, 15, 20, 25, 30, 35]
    },
    index=['a', 'b', 'c', 'd', 'e', 'f']
)

In [36]:
df

    Name  Age  Bamboo Stick
a  Pandy    6            10
b  Sandy    7            15
c  Randy    4            20
d  Mandy    5            25
e  Candy    4            30
f  Landy    2            35

### loc

#### column

In [37]:
df.loc['b']

Name            Sandy
Age                 7
Bamboo Stick       15
Name: b, dtype: object

#### both row & column

In [38]:
df.loc[['b','c'], ['Name','Age']]

    Name  Age
b  Sandy    7
c  Randy    4

### Conevrt to csv

In [39]:
df.to_csv('panda.csv')

We would see a csv file on the local folder

#### No index

In [40]:
df.to_csv('noIndex_panda.csv', index=False)

In [41]:
df

    Name  Age  Bamboo Stick
a  Pandy    6            10
b  Sandy    7            15
c  Randy    4            20
d  Mandy    5            25
e  Candy    4            30
f  Landy    2            35

### Statistical Analysis

In [42]:
df.describe()

            Age  Bamboo Stick
count  6.000000      6.000000
mean   4.666667     22.500000
std    1.751190      9.354143
min    2.000000     10.000000
25%    4.000000     16.250000
50%    4.500000     22.500000
75%    5.750000     28.750000
max    7.000000     35.000000

# EXERCISE SESSION

### Json

In [43]:
df_json=pd.read_json('test.json')

In [44]:
df_json

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [45]:
df_json.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406

### shape

In [46]:
df_json.shape

(6, 4)

### Read CSV

In [102]:
df_json.to_csv("test_excel.csv",index=False)

In [103]:
df_csv=pd.read_csv("test_excel.csv")

In [49]:
df_csv

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

### excel convert

In [50]:
df_excel=df_csv.drop('Calories',axis=1)

In [51]:
df_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

pip install openpyxl

In [104]:
df_excel.to_excel("output.xlsx",index=False)

In [105]:
df_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

### Read Excel

In [109]:
read_excel=pd.read_excel("output.xlsx")

In [110]:
#read_excel=pd.read_excel("output.xlsx",sheet_name='Sheet1')

In [111]:
read_excel

   Duration  Pulse  Maxpulse
0        60    110       130
1        60    117       145
2        60    103       135
3        45    109       175
4        45    117       148
5        60    102       127

###  Data Merge

In [55]:
left= pd.DataFrame({
    'ID': [1,2,3],
    'Name': ['Pandy', 'Mandy',' Sandy']
})
right= pd.DataFrame({
    'ID': [1,2,4],
    'Hobby': ['Eating', 'Dancing',' Sleeping']
})

In [56]:
merged_df=pd.merge(left,right, on='ID', how='inner')

In [57]:
merged_df

   ID   Name    Hobby
0   1  Pandy   Eating
1   2  Mandy  Dancing

### concat

### row

In [58]:
concat_df=pd.concat([left,right],ignore_index=True) #ignore index helps to prevent overflow of index

In [59]:
concat_df

   ID    Name      Hobby
0   1   Pandy        NaN
1   2   Mandy        NaN
2   3   Sandy        NaN
3   1     NaN     Eating
4   2     NaN    Dancing
5   4     NaN   Sleeping

### coulmn

In [60]:
concat_df=pd.concat([left,right],axis=1)

In [61]:
concat_df

   ID    Name  ID      Hobby
0   1   Pandy   1     Eating
1   2   Mandy   2    Dancing
2   3   Sandy   4   Sleeping

#  NUMERICAL RANDOM DATA

### Series

In [62]:
import numpy as np

In [63]:
ser = pd.Series(np.random.rand(34))

In [64]:
ser

0     0.050750
1     0.871395
2     0.250340
3     0.474104
4     0.554663
5     0.357964
6     0.215356
7     0.132568
8     0.678764
9     0.455934
10    0.198132
11    0.746039
12    0.007158
13    0.123523
14    0.125114
15    0.445683
16    0.353926
17    0.883969
18    0.676283
19    0.000587
20    0.523714
21    0.903016
22    0.924812
23    0.668521
24    0.241289
25    0.688157
26    0.761339
27    0.636648
28    0.671704
29    0.622848
30    0.939980
31    0.225102
32    0.392285
33    0.487811
dtype: float64

In [65]:
type(ser)

pandas.core.series.Series

### Data Frame

In [66]:
newdf = pd.DataFrame(np.random.rand(334,5))

In [67]:
newdf

            0         1         2         3         4
0    0.461816  0.397258  0.770078  0.179418  0.464144
1    0.619748  0.925045  0.413380  0.077220  0.012170
2    0.755122  0.482221  0.995550  0.531050  0.365125
3    0.930743  0.645810  0.123393  0.339650  0.818827
4    0.650777  0.630234  0.047567  0.193642  0.668881
..        ...       ...       ...       ...       ...
329  0.569674  0.554167  0.509095  0.744837  0.924948
330  0.938687  0.261381  0.552042  0.572425  0.372531
331  0.991998  0.352545  0.965508  0.857539  0.548329
332  0.757641  0.828424  0.552521  0.183446  0.397535
333  0.526629  0.595310  0.980170  0.647047  0.659879

[334 rows x 5 columns]

In [68]:
type(newdf)

pandas.core.frame.DataFrame

In [69]:
newdf.index

RangeIndex(start=0, stop=334, step=1)

In [70]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

### Convert to Numpy

In [71]:
newdf.to_numpy()

array([[0.46181599, 0.39725815, 0.77007783, 0.17941801, 0.464144  ],
       [0.61974842, 0.92504498, 0.41338006, 0.07722004, 0.01217046],
       [0.7551218 , 0.48222146, 0.99555018, 0.53104955, 0.36512531],
       ...,
       [0.99199751, 0.35254496, 0.96550836, 0.85753901, 0.54832931],
       [0.7576408 , 0.8284243 , 0.55252087, 0.18344582, 0.39753505],
       [0.52662894, 0.59530965, 0.98016963, 0.64704747, 0.6598792 ]],
      shape=(334, 5))

In [72]:
newdf.head()

          0         1         2         3         4
0  0.461816  0.397258  0.770078  0.179418  0.464144
1  0.619748  0.925045  0.413380  0.077220  0.012170
2  0.755122  0.482221  0.995550  0.531050  0.365125
3  0.930743  0.645810  0.123393  0.339650  0.818827
4  0.650777  0.630234  0.047567  0.193642  0.668881

### Sort

In [73]:
sortdf = pd.DataFrame(np.random.randint(0,50,size=(334,5)))

In [74]:
sortdf

      0   1   2   3   4
0    30  42   1  21  29
1    38  32  22   0   9
2    35   2  33   9  15
3     1  40  18   1  13
4    37   1  28  24  37
..   ..  ..  ..  ..  ..
329  15  38  28  22  11
330  28  11   3  49  14
331   5   7  27  33  32
332  37   2  35  22  22
333  45  38  12  40  40

[334 rows x 5 columns]

In [75]:
sortdf.head()

    0   1   2   3   4
0  30  42   1  21  29
1  38  32  22   0   9
2  35   2  33   9  15
3   1  40  18   1  13
4  37   1  28  24  37

In [76]:
sortdf.sort_index(axis=1,ascending=False) # To Column

      4   3   2   1   0
0    29  21   1  42  30
1     9   0  22  32  38
2    15   9  33   2  35
3    13   1  18  40   1
4    37  24  28   1  37
..   ..  ..  ..  ..  ..
329  11  22  28  38  15
330  14  49   3  11  28
331  32  33  27   7   5
332  22  22  35   2  37
333  40  40  12  38  45

[334 rows x 5 columns]

In [77]:
sortdf.sort_index(axis=0,ascending=False) # To Row

      0   1   2   3   4
333  45  38  12  40  40
332  37   2  35  22  22
331   5   7  27  33  32
330  28  11   3  49  14
329  15  38  28  22  11
..   ..  ..  ..  ..  ..
4    37   1  28  24  37
3     1  40  18   1  13
2    35   2  33   9  15
1    38  32  22   0   9
0    30  42   1  21  29

[334 rows x 5 columns]

In [78]:
type(sortdf)

pandas.core.frame.DataFrame

In [79]:
type(sortdf[0])

pandas.core.series.Series

### Update Value (loc)

In [80]:
sortdf.loc[0,0]=654

In [81]:
sortdf

       0   1   2   3   4
0    654  42   1  21  29
1     38  32  22   0   9
2     35   2  33   9  15
3      1  40  18   1  13
4     37   1  28  24  37
..   ...  ..  ..  ..  ..
329   15  38  28  22  11
330   28  11   3  49  14
331    5   7  27  33  32
332   37   2  35  22  22
333   45  38  12  40  40

[334 rows x 5 columns]

In [82]:
sortdf.columns=list("ABCDE")

In [83]:
sortdf

       A   B   C   D   E
0    654  42   1  21  29
1     38  32  22   0   9
2     35   2  33   9  15
3      1  40  18   1  13
4     37   1  28  24  37
..   ...  ..  ..  ..  ..
329   15  38  28  22  11
330   28  11   3  49  14
331    5   7  27  33  32
332   37   2  35  22  22
333   45  38  12  40  40

[334 rows x 5 columns]

In [84]:
sortdf.loc[0,'B']=774

In [85]:
sortdf

       A    B   C   D   E
0    654  774   1  21  29
1     38   32  22   0   9
2     35    2  33   9  15
3      1   40  18   1  13
4     37    1  28  24  37
..   ...  ...  ..  ..  ..
329   15   38  28  22  11
330   28   11   3  49  14
331    5    7  27  33  32
332   37    2  35  22  22
333   45   38  12  40  40

[334 rows x 5 columns]

In [86]:
sortdf.loc[:,:] # to see all the row and column values

       A    B   C   D   E
0    654  774   1  21  29
1     38   32  22   0   9
2     35    2  33   9  15
3      1   40  18   1  13
4     37    1  28  24  37
..   ...  ...  ..  ..  ..
329   15   38  28  22  11
330   28   11   3  49  14
331    5    7  27  33  32
332   37    2  35  22  22
333   45   38  12  40  40

[334 rows x 5 columns]

### Single Condition

In [87]:
sortdf.loc[(sortdf['A']>48)]

       A    B   C   D   E
0    654  774   1  21  29
50    49   17  49  23  32
84    49   27  23  33   9
109   49   19  31   4  10
150   49    0  35  35  15
152   49    1  45  25   2
162   49   11  24  12  16
210   49   39  48  27  27
225   49   29   8  27   3
247   49    6  24  40  42
273   49   42  33  44  36
308   49   33   7  30  34

### Multiple Condition

In [88]:
sortdf.loc[(sortdf['A']>48) & (sortdf['C']>40)]

      A   B   C   D   E
50   49  17  49  23  32
152  49   1  45  25   2
210  49  39  48  27  27

### iloc

In [89]:
sortdf.iloc[0,4]

np.int32(29)

In [90]:
newdf.iloc[[0,225],[0,2]]

            0         2
0    0.461816  0.770078
225  0.412915  0.750719

| Feature                | `.loc`                                                             | `.iloc`                                                                 |
| ---------------------- | ------------------------------------------------------------------ | ----------------------------------------------------------------------- |
| **Type of indexing**   | **Label-based** ‚Üí You select rows/columns by their names (labels). | **Integer-based** ‚Üí You select rows/columns by their integer positions. |
| **Inclusive behavior** | Both start and end labels are **inclusive** when slicing.          | The end index is **exclusive** when slicing (like Python list slicing). |
| **Accepts**            | Row/column labels, boolean arrays, slices with labels.             | Row/column integer positions, boolean arrays, slices with integers.     |
| **Errors**             | Throws `KeyError` if label is not found.                           | Throws `IndexError` if index is out of range.                           |

### drop

### row

In [91]:
sortdf.drop(2)

       A    B   C   D   E
0    654  774   1  21  29
1     38   32  22   0   9
3      1   40  18   1  13
4     37    1  28  24  37
5      7    1  40  22  14
..   ...  ...  ..  ..  ..
329   15   38  28  22  11
330   28   11   3  49  14
331    5    7  27  33  32
332   37    2  35  22  22
333   45   38  12  40  40

[333 rows x 5 columns]

### column

In [92]:
sortdf.drop(['E'],axis=1)

       A    B   C   D
0    654  774   1  21
1     38   32  22   0
2     35    2  33   9
3      1   40  18   1
4     37    1  28  24
..   ...  ...  ..  ..
329   15   38  28  22
330   28   11   3  49
331    5    7  27  33
332   37    2  35  22
333   45   38  12  40

[334 rows x 4 columns]

### Permanently Drop Column

In [93]:
sortdf.drop(['D'],axis=1,inplace=True)

In [94]:
sortdf

       A    B   C   E
0    654  774   1  29
1     38   32  22   9
2     35    2  33  15
3      1   40  18  13
4     37    1  28  37
..   ...  ...  ..  ..
329   15   38  28  11
330   28   11   3  14
331    5    7  27  32
332   37    2  35  22
333   45   38  12  40

[334 rows x 4 columns]

### Permanently Drop Row

In [95]:
sortdf.drop([2,3],axis=0,inplace=True)

In [96]:
sortdf

       A    B   C   E
0    654  774   1  29
1     38   32  22   9
4     37    1  28  37
5      7    1  40  14
6      0   24  18   9
..   ...  ...  ..  ..
329   15   38  28  11
330   28   11   3  14
331    5    7  27  32
332   37    2  35  22
333   45   38  12  40

[332 rows x 4 columns]

### Reset Rows

In [97]:
sortdf.reset_index() #adds an extra index

     index    A    B   C   E
0        0  654  774   1  29
1        1   38   32  22   9
2        4   37    1  28  37
3        5    7    1  40  14
4        6    0   24  18   9
..     ...  ...  ...  ..  ..
327    329   15   38  28  11
328    330   28   11   3  14
329    331    5    7  27  32
330    332   37    2  35  22
331    333   45   38  12  40

[332 rows x 5 columns]

In [98]:
sortdf.reset_index(drop=True)#drops the extra index

       A    B   C   E
0    654  774   1  29
1     38   32  22   9
2     37    1  28  37
3      7    1  40  14
4      0   24  18   9
..   ...  ...  ..  ..
327   15   38  28  11
328   28   11   3  14
329    5    7  27  32
330   37    2  35  22
331   45   38  12  40

[332 rows x 4 columns]

### Null

In [99]:
sortdf.loc[4]=None

In [100]:
sortdf

         A      B     C     E
0    654.0  774.0   1.0  29.0
1     38.0   32.0  22.0   9.0
4      NaN    NaN   NaN   NaN
5      7.0    1.0  40.0  14.0
6      0.0   24.0  18.0   9.0
..     ...    ...   ...   ...
329   15.0   38.0  28.0  11.0
330   28.0   11.0   3.0  14.0
331    5.0    7.0  27.0  32.0
332   37.0    2.0  35.0  22.0
333   45.0   38.0  12.0  40.0

[332 rows x 4 columns]

In [101]:
sortdf.loc[4].isnull() #check

A    True
B    True
C    True
E    True
Name: 4, dtype: bool